app/controllers/markets_controller.rb

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1
---
  def findMarket
    return Market.find(params[:id].to_i)