app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def find_vendor
    return Vendor.find(params[:id].to_i)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 2]]